// TODO: optimise server connection for grids: read only needed resources
// TODO: баг с фокусированием в тестовой иерархии, при выбранной подгруппе нажать на "тестовая иерархия", выделение подгруппы может не исчезнуть
// TODO: при отсутствии подгруженных данных вместо вывода null сделать отображение сообщения
// TODO: баг с колонкой действия при переключении режима для таблицы пользователей и других таблиц
// TODO: баг: выделение ячеек таблиц в Chrome
// TODO: баг: предзаполнение логина и пароля при добавлении пользователя в Chrome
