// TODO: optimise server connection for grids: read only needed resources
// TODO: баг с фокусированием в тестовой иерархии, при выбранной подгруппе нажать на "тестовая иерархия", выделение подгруппы может не исчезнуть
// TODO: при отсутствии подгруженных данных вместо вывода null сделать отображение сообщения
// TODO: баг с колонкой действия при переключении режима для таблицы пользователей и других таблиц - готово
// TODO: баг: выделение ячеек таблиц в Chrome
// TODO: баг: предзаполнение логина и пароля при добавлении пользователя в Chrome
// TODO: баг с неучетом текущей прокрутки при переключении между режимом навигации и обычным для таблиц
// TODO: объединить формы создания и обновления ресурсов
// TODO: баг: мерцание при изменении топологии в форме
// TODO: улучшить ячейку действий для таблицы, если больше 2х действий
// TODO: баг: в форме изменения теста при выборе другой топологии и последующем нажатии на "к текущим значениям" затираются поля исходных вершин
// TODO: скорректировать вид курсора в блоке загрузки файла
// TODO: при изменении названия вершины в общей топологии, для которой есть линии, в компоненте временно образуется некорректный конфиг
// TODO: есть возможность сделать в общей топологии все вершины генераторами, при этом может возникнуть несогласованность для уже имеющихся тестов
// TODO: проблема: при работе с формой при нажатии за ее границу все данные теряются
// TODO: при создании задания не очевидно, что при выборе подгрупп/групп в задание включабтся все тесты из них (Максим сказал)
// TODO: проблема: некорректная сортировка при числах в строках (_2.1, _2.10, _2.2)
// TODO: затираются поля в описании теста (сообщения Максима 31.01.2026)
