// TODO: optimise server connection for grids: read only needed resources
// TODO: баг с фокусированием в тестовой иерархии, при выбранной подгруппе нажать на "тестовая иерархия", выделение подгруппы может не исчезнуть
// TODO: при отсутствии подгруженных данных вместо вывода null сделать отображение сообщения
// TODO: баг с колонкой действия при переключении режима для таблицы пользователей и других таблиц - готово
// TODO: баг: выделение ячеек таблиц в Chrome
// TODO: баг: предзаполнение логина и пароля при добавлении пользователя в Chrome
// TODO: баг с неучетом текущей прокрутки при переключении между режимом навигации и обычным для таблиц
// TODO: объединить формы создания и обновления ресурсов
// TODO: баг: мерцание при изменении топологии в форме
// TODO: улучшить ячейку действий для таблицы, если больше 2х действий
// TODO: баг: в форме изменения теста при выборе другой топологии и последующем нажатии на "к текущим значениям" затираются поля исходных вершин
// TODO: скорректировать вид курсора в блоке загрузки файла
// TODO: при изменении названия вершины в общей топологии, для которой есть линии, в компоненте временно образуется некорректный конфиг
