// TODO: optimise server connection for grids: read only needed resources
// TODO: баг с фокусированием в тестовой иерархии, при выбранной подгруппе нажать на "тестовая иерархия", выделение подгруппы может не исчезнуть
// TODO: при отсутствии подгруженных данных вместо вывода null сделать отображение сообщения
// TODO: баг с колонкой действия при переключении режима для таблицы пользователей и других таблиц - готово
// TODO: баг: выделение ячеек таблиц в Chrome
// TODO: баг: предзаполнение логина и пароля при добавлении пользователя в Chrome
// TODO: баг с неучетом текущей прокрутки при переключении между режимом навигации и обычным для таблиц
// TODO: объединить формы создания и обновления ресурсов
// TODO: баг: мерцание при изменении топологии в форме
